In [3]:
import pandas as pd
import numpy as np

### (A) Series

A panda series can hold a variety of object types. It can also hold different types take in lists as data and index them, or we can supply the indexes or can even take in dictionaries where it sets the index and data in the series from what it sees. Could even pass in a list of built in functions such as sum, len, dtype etc.

In [2]:
com_list = np.array([1,2,3,4])
np_info = ('Elm Park','PGC', 'Milltown', 'Waterloo')
com_dict = {1:'Elm Park',2:'Portmarnock',4:'Royal Cinqueport', 7:'NBGC'}

In [3]:
pd.Series(com_dict)

1            Elm Park
2         Portmarnock
4    Royal Cinqueport
7                NBGC
dtype: object

In [4]:
pd.Series(com_list, np_info)

Elm Park    1
PGC         2
Milltown    3
Waterloo    4
dtype: int64

In [5]:
pd.Series([len,sum,max])

0    <built-in function len>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [9]:
ser_1 = pd.Series({1:'Elm Park',2:'Portmarnock',4:'Royal Cinqueport', 7:'NBGC'})
ser_2 = pd.Series({1:'Elm Park',2:'Portmarnock',4:'Royal Cinqueport', 6:'RCD'})

In [8]:
ser_1 + ser_2

1                    Elm ParkElm Park
2              PortmarnockPortmarnock
4    Royal CinqueportRoyal Cinqueport
6                                 NaN
7                                 NaN
dtype: object

NaN is returned is things aren't matched on indexes when adding series. Note is we were using integers, they would've been converted to floats upon addition.

### (B) Dataframes

A dataframe is groups of series which share indexes.

In [10]:
from numpy.random import randn

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [13]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

##### Selecting Columns

In [21]:
# selecting columns
df['y']
#selecting multiple columns
df[['y','x']]

          y         x
a  0.907969  0.628133
b -0.848077 -0.319318
c  0.528813  0.740122
d -0.933237 -0.758872
e  2.605967  1.978757

In [15]:
df['r'] = df['w']*df['z']

In [16]:
df

          w         x         y         z         r
a  2.706850  0.628133  0.907969  0.503826  1.363781
b  0.651118 -0.319318 -0.848077  0.605965  0.394555
c -2.018168  0.740122  0.528813 -0.589001  1.188702
d  0.188695 -0.758872 -0.933237  0.955057  0.180215
e  0.190794  1.978757  2.605967  0.683509  0.130410

In [19]:
df.drop('z',axis=1,inplace=True)

In [20]:
df

          w         x         y         r
a  2.706850  0.628133  0.907969  1.363781
b  0.651118 -0.319318 -0.848077  0.394555
c -2.018168  0.740122  0.528813  1.188702
d  0.188695 -0.758872 -0.933237  0.180215
e  0.190794  1.978757  2.605967  0.130410

#### Selecting Rows ( 2 ways)

In [22]:
df.loc['b'] # returns a series too

w    0.651118
x   -0.319318
y   -0.848077
r    0.394555
Name: b, dtype: float64

In [23]:
df.iloc[1]

w    0.651118
x   -0.319318
y   -0.848077
r    0.394555
Name: b, dtype: float64

In [24]:
 df.loc['d',['x','r']]

x   -0.758872
r    0.180215
Name: d, dtype: float64

In [27]:
df.iloc[3,[1,3]]

x   -0.758872
r    0.180215
Name: d, dtype: float64

In [29]:
booldf = df > 0

In [30]:
df[booldf]
# df[df>0]

          w         x         y         r
a  2.706850  0.628133  0.907969  1.363781
b  0.651118       NaN       NaN  0.394555
c       NaN  0.740122  0.528813  1.188702
d  0.188695       NaN       NaN  0.180215
e  0.190794  1.978757  2.605967  0.130410

Can do this for columns too

In [38]:
df[df['w']> 0][['y','r']]

          y         r
a  0.907969  1.363781
b -0.848077  0.394555
d -0.933237  0.180215
e  2.605967  0.130410

 We can use multiple conditions but our usual AND and OR operators do not work. Instead we must use & and | for making comparisons between series as we see below.

In [40]:
df[(df['w']>0) & (df['r']<1)]

          w         x         y         r
b  0.651118 -0.319318 -0.848077  0.394555
d  0.188695 -0.758872 -0.933237  0.180215
e  0.190794  1.978757  2.605967  0.130410

In [42]:
df[(df['x']<0) | (df['r']<1)]

          w         x         y         r
b  0.651118 -0.319318 -0.848077  0.394555
d  0.188695 -0.758872 -0.933237  0.180215
e  0.190794  1.978757  2.605967  0.130410

One can reset the index, but need to specify if you want this to occur in place.

In [44]:
df.reset_index()

  index         w         x         y         r
0     a  2.706850  0.628133  0.907969  1.363781
1     b  0.651118 -0.319318 -0.848077  0.394555
2     c -2.018168  0.740122  0.528813  1.188702
3     d  0.188695 -0.758872 -0.933237  0.180215
4     e  0.190794  1.978757  2.605967  0.130410

We can reset the index to be a column of our own choosing. This also has to be set inplace if you want it to be permanent too. It will delete the old index, so you might want to copy that old index to another column first.

In [45]:
newstr = 'DUB HCP PPL TCD ACT'.split()

In [47]:
df['tags'] = newstr

In [49]:
df.set_index('tags')

             w         x         y         r
tags
DUB   2.706850  0.628133  0.907969  1.363781
HCP   0.651118 -0.319318 -0.848077  0.394555
PPL  -2.018168  0.740122  0.528813  1.188702
TCD   0.188695 -0.758872 -0.933237  0.180215
ACT   0.190794  1.978757  2.605967  0.130410

### Dataframes (c)

Index hierarchy, or in other words multiple levels to an index. This seems much more complicated (code box directly below, so will definitely have to be revisited.)

In [62]:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [63]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [67]:
new_df = pd.DataFrame(randn(6,2),index=hier_index,columns=['A','B'])
new_df

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   3 -0.031160  1.939932

In [69]:
new_df.loc['G1'].loc[1]

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [74]:
new_df.index.names = ['Groups','num']

In [75]:
new_df

                   A         B
Groups num
G1     1   -0.925874  1.862864
       2   -1.133817  0.610478
       3    0.386030  2.084019
G2     1   -0.376519  0.230336
       2    0.681209  1.035125
       3   -0.031160  1.939932

In [79]:
new_df.loc['G1'].loc[1]['B']

1.8628641384939535

We can ignore multilevels by using the cross-section function to grab items. Crosssection is .xs

In [78]:
 new_df.xs(1,level='num')

               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336

### (C) Pandas - Missing Data 
We can drop columns, rows which have any Nan or Null rows in it. We can also set thresholds for this instead. We can also just fill it with values.

In [80]:
a_dict = {'A':[1,2,3],'B':[1,np.nan,100],'C':[43,np.nan,np.nan]}

In [88]:
panda = pd.DataFrame(a_dict)
panda

   A      B     C
0  1    1.0  43.0
1  2    NaN   NaN
2  3  100.0   NaN

In [89]:
panda.dropna(thresh = 2,axis=1)

   A      B
0  1    1.0
1  2    NaN
2  3  100.0

In [92]:
panda.fillna(value = panda.iloc[0].max())

   A      B     C
0  1    1.0  43.0
1  2   43.0  43.0
2  3  100.0  43.0

### (D) Groupby

In [2]:
import pandas as pd
import numpy as np
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [10]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [12]:
byComp = df.groupby('Company')
byComp.mean()
# note a dataframe is returned.

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [16]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### (E) Merging, Joining and Concatenating

Difference between merging and joining is that for merging, we merge on a column(s) that is our key. For joining the column that we join on is our index. All the dataframes he uses for the examples are in the code in the folder, so I won't repeat it here.

 ### (F) Operations

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df['col2'].unique() # returns a numPy array
#len(df['col2'].unique())

array([444, 555, 666])

In [6]:
df['col2'].nunique() # number of uniques

3

In [15]:
df['col2'].value_counts() # effectively counts the number of uniques and shows all data entries

444    2
555    1
666    1
Name: col2, dtype: int64

In [16]:
df['col1']> 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [14]:
 df[df['col1']> 2] # conditional selection of data

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [17]:
# we can define a function and apply it to a column where it will be broadcast on it.
def times10(x):
    return 10*x

In [18]:
df['col1'].apply(times10)

0    10
1    20
2    30
3    40
Name: col1, dtype: int64

In [19]:
# very powerful with lambda expressions
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [25]:
 df.drop('col2',axis=1)#,inplace=True)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [26]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
df.sort_values(by = 'col2')   # note index stays attached to the row

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [29]:
df.isnull()
#df.dropna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

Filling NaN values with something else.

In [7]:
df_2 = pd.DataFrame({'col1':[1,np.nan,3,4],'col2':[444,555,666,np.nan],'col3':['abc','def','ghi','xyz']})
df_2.head()

   col1   col2 col3
0   1.0  444.0  abc
1   NaN  555.0  def
2   3.0  666.0  ghi
3   4.0    NaN  xyz

In [11]:
df_2.dropna()

   col1   col2 col3
0   1.0  444.0  abc
2   3.0  666.0  ghi

In [13]:
df_2.fillna("WAS NULL")

       col1      col2 col3
0         1       444  abc
1  WAS NULL       555  def
2         3       666  ghi
3         4  WAS NULL  xyz

## Pivot Tables

In [14]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [15]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [16]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## (G) Input and Output Data

In [16]:
import pandas as pd
import numpy as np

In [6]:
pwd

'/Users/Conoromara/Desktop/data/work'

In [17]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [35]:
df.to_csv("My_html_table", index=False)

In [36]:
pd.read_csv("My_html_table")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [55]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [68]:
df = pd.read_html('https://en.wikipedia.org/wiki/Counties_of_Ireland')

In [70]:
type(df) # converts list of tables into dataframes.

list

In [74]:
df[2] # cycle through the list to find the correct table in our dataframe.

,County,County.1,Irish name[19],Ulster-Scotsname(s),County town,Mostpopulouscity/town,Province,Region,Unnamed: 8
0,Antrim,Antrim,Aontroim(Contae Aontroma),Anthrim[20]Antrm[21]Entrim[22],Ballymena (formerly Carrickfergus 18501970),Belfast (part),Ulster,Northern Ireland UKN0,NaN
1,Armagh,Armagh,Ard Mhacha(Contae Ard Mhacha),Airmagh[23],Armagh,Craigavon,Ulster,Northern Ireland UKN0,NaN
2,Carlow,Carlow,Ceatharlach(Contae Cheatharlach),NaN,Carlow,Carlow,Leinster,South-East IE024,
3,Cavan,Cavan,An Cabhn(Contae an Chabhin),NaN,Cavan,Cavan,Ulster,Border IE011,
4,Clare,Clare,An Clr(Contae an Chlir),NaN,Ennis,Ennis,Munster,Mid-West IE023,
5,Cork,Cork,Corcaigh(Contae Chorca),Coark[24],Cork,Cork,Munster,South-West IE025,NaN
6,Donegal,Donegal,Dn na nGall(Contae Dhn na nGall),DinnygalDunnygal[24],Lifford,Letterkenny,Ulster,Border IE011,
7,Down,Down,An Dn(Contae an Din),DoonDoun,Downpatrick,Belfast (part),Ulster,Northern Ireland UKN0,NaN
8,Dublin,Dublin,Baile tha Cliath(Contae Bhaile tha Cliath),NaN,Dublin,Dublin,Leinster,Dublin IE021,NaN
9,NaN,Dn LaoghaireRathdown,Dn LaoghaireRth an Din,NaN,Dn Laoghaire,Dn Laoghaire,Leinster,Dublin IE021,
10,NaN,Fingal,Fine Gall,NaN,Swords,Swords,Leinster,Dublin IE021,
11,NaN,South Dublin,th Cliath Theas,NaN,Tallaght,Tallaght,Leinster,Dublin IE021,
12,Fermanagh,Fermanagh,Fear Manach(Contae Fhear Manach),Fermanay,Enniskillen,Enniskillen,Ulster,Northern Ireland UKN0,NaN
13,Galway,Galway,Gaillimh(Contae na Gaillimhe),NaN,Galway,Galway,Connacht,West IE013,NaN
14,Kerry,Kerry,Ciarra(Contae Chiarra),NaN,Tralee,Tralee,Munster,South-West IE025,
15,Kildare,Kildare,Cill Dara(Contae Chill Dara),NaN,Naas,Newbridge,Leinster,Mid-East IE022,
16,Kilkenny,Kilkenny,Cill Chainnigh(Contae Chill Chainnigh),NaN,Kilkenny,Kilkenny,Leinster,South-East IE024,
17,Laois,Laois,Laois(Contae Laoise),NaN,Portlaoise,Portlaoise,Leinster,Midlands IE012,
18,Leitrim,Leitrim,Liatroim(Contae Liatroma),NaN,Carrick-on-Shannon,Carrick-on-Shannon,Connacht,Border IE011,
19,Limerick,Limerick,Luimneach(Contae Luimnigh),Lmerick[24],Limerick,Limerick,Munster,Mid-West IE023,NaN
20,Londonderry[nb 2],Londonderry[nb 2],Doire(Contae Dhoire),Lunnonderrie,Coleraine,Derry,Ulster,Northern Ireland UKN0,NaN
21,Longford,Longford,An Longfort(Contae an Longfoirt),Langfurd[24],Longford,Longford,Leinster,Midlands IE012,
22,Louth,Louth,L(Contae L),NaN,Dundalk,Drogheda,Leinster,Border IE011,
23,Mayo,Mayo,Maigh Eo(Contae Mhaigh Eo),NaN,Castlebar,Castlebar,Connacht,West IE013,
24,Meath,Meath,An Mh(Contae na M),NaN,Navan(formerly Trim),Navan,Leinster,Mid-East IE022,
25,Monaghan,Monaghan,Muineachn(Contae Mhuineachin),Ronelann[25],Monaghan,Monaghan,Ulster,Border IE011,
26,Offaly,Offaly,Ubh Fhail(Contae Ubh Fhail),NaN,Tullamore (formerly Philipstown),Tullamore,Leinster,Midlands IE012,
27,Roscommon,Roscommon,Ros Comin(Contae Ros Comin),NaN,Roscommon,Roscommon,Connacht,West IE013,
28,Sligo,Sligo,Sligeach(Contae Shligigh),NaN,Sligo,Sligo,Connacht,Border IE011,
29,Tipperary,Tipperary,Tiobraid rann(Contae Thiobraid rann),NaN,Nenagh (formerly Clonmel& Cashel),Clonmel,Munster,NaN,
30,Tyrone,Tyrone,Tr Eoghain(Contae Thr Eoghain),Owenslann[25],Omagh,Omagh,Ulster,Northern Ireland UKN0,NaN
31,Waterford,Waterford,Port Lirge(Contae Phort Lirge),Wattrford[24],Dungarvan(formerly Waterford),Waterford,Munster,South-East IE024,NaN
32,Westmeath,Westmeath,An Iarmh(Contae na hIarmh),NaN,Mullingar,Athlone,Leinster,South-East IE024,
33,Wexford,Wexford,Loch Garman(Contae Loch Garman),NaN,Wexford,Wexford,Leinster,South-East IE024,
34,Wicklow,Wicklow,Cill Mhantin(Contae Chill Mhantin),NaN,Wicklow,Bray,Leinster,Mid-East IE022,

In [67]:
from sqlalchemy import engine